import { Header, Wrapper } from './Timers.styled';

import Timer from './Timer';
const Timers = ({ date, action }) => { 
    const year = new Date().getFullYear();
    return (
        <Wrapper>
            <div>
                <Header>До закінчення року залишилось</Header>
                <Timer targetDate={`12/31/${year}`} />
            </div>
            <div>
                <Header>До досягнення мети залишилось</Header>
                <Timer targetDate={date} action={action} />
            </div>
            
        </Wrapper>
    )
};

export default Timers;

// Таймер
//---------------------------------------------------------------------------------------------
// 1 Таймер приймає два обовязкові пропси date і action <Timers date={date} action={action} />
//---------------------------------------------------------------------------------------------
// 2 Щоб вивести таймери в компоненті імпортуємо Timers в необхідний компонент
// до прикладу(import Timers from '../Timers;)
// та передаємо в нього дату закінчення таймеру в форматі строки(місяць/число/рік)
// до прикладу(<Timers date={'10/16/2022'} action={action} />)
//---------------------------------------------------------------------------------------------
// 3 Дата закінчення року обчислюється автоматично
//---------------------------------------------------------------------------------------------
// 4 Таймер перетворюється в секундомір коли час закінчився, а книги не всі прочитані
// і колір значення дати міняється на червоний
// ---------------------------------------------------------------------------------------------
// 5 Для керування секундоміром передаються значення в action
// для того що бін працював необхідно в action передати будь-яке число крім 0 та 1
// - вони зарезервовані для очистки і зупинки секундоміра
// до прикладу(<Timers date={date} action={999} />)
// ---------------------------------------------------------------------------------------------
// 6 Очищати секундомір потрібно після закриття модалки яка вітає з успіхом
// і пропонує почати нове тренування
// для цього в нього передається в action число 1, яке при старті нового тренування необхідно
// змінити на будь - яке число крім 0 та 1, щоб він знову спрацював при умовах з пункту 4
// ---------------------------------------------------------------------------------------------
// 7 Зупиняти секундомір необхідно після того як всі
// непрочитані вчасно книги змінюють статус на прочитані
// для цього в нього передається в action число 1, яке при старті нового тренування необхідно
// змінити на будь - яке число крім 0 та 1
// ---------------------------------------------------------------------------------------------